In [1]:
#TitanicPrdiction
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
#Extracting Data
df_train_dataset=pd.read_csv(r'C:\Users\Umesh\Documents\JupyterNotebook\titanic\train.csv')
df_test_dataset=pd.read_csv(r'C:\Users\Umesh\Documents\JupyterNotebook\titanic/test.csv')
df_gender_submission=pd.read_csv(r'C:\Users\Umesh\Documents\JupyterNotebook\titanic/gender_submission.csv')

In [3]:
df_train_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
#Concatinating Train and Test Dataset
df_complete_data=pd.concat([df_train_dataset,df_test_dataset],sort=True)

In [5]:
#Data Preperation
df_complete_data.describe()

,Age,Fare,Parch,PassengerId,Pclass,SibSp,Survived
count,1046.000000,1308.000000,1309.000000,1309.000000,1309.000000,1309.000000,891.000000
mean,29.881138,33.295479,0.385027,655.000000,2.294882,0.498854,0.383838
std,14.413493,51.758668,0.865560,378.020061,0.837836,1.041658,0.486592
min,0.170000,0.000000,0.000000,1.000000,1.000000,0.000000,0.000000
25%,21.000000,7.895800,0.000000,328.000000,2.000000,0.000000,0.000000
50%,28.000000,14.454200,0.000000,655.000000,3.000000,0.000000,0.000000
75%,39.000000,31.275000,0.000000,982.000000,3.000000,1.000000,1.000000
max,80.000000,512.329200,9.000000,1309.000000,3.000000,8.000000,1.000000

In [6]:
#Survived, Age, Cabin, Fare, embarked have null values
df_complete_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
Age            1046 non-null float64
Cabin          295 non-null object
Embarked       1307 non-null object
Fare           1308 non-null float64
Name           1309 non-null object
Parch          1309 non-null int64
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Sex            1309 non-null object
SibSp          1309 non-null int64
Survived       891 non-null float64
Ticket         1309 non-null object
dtypes: float64(3), int64(4), object(5)
memory usage: 132.9+ KB

In [7]:
#Total Dataset
df_complete_data.shape

(1309, 12)

In [8]:
#Changing Fare Null Values
df_complete_data['Fare'].isnull().sum()

1

In [9]:
#Creating Median Value 
Med_value=df_complete_data[df_complete_data['Pclass']==3]['Fare'].median()
df_complete_data.loc[df_complete_data['Ticket']=='3701',['Fare']]=Med_value

In [10]:
#Fare null value changed and Filled
df_complete_data['Fare'].isnull().sum()

0

In [11]:
#Checking Null values in Embarked
df_complete_data['Embarked'].isnull().sum()

2

In [12]:
df_complete_data.loc[df_complete_data['Ticket']=='113572',['Embarked']]='S'

In [13]:
df_complete_data['Ticket'].isnull().sum()

0

In [14]:
#All are false means data is filled
df_complete_data.loc[df_complete_data['Ticket']=='113572'].isnull().describe()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
count,2,2,2,2,2,2,2,2,2,2,2,2
unique,1,1,1,1,1,1,1,1,1,1,1,1
top,False,False,False,False,False,False,False,False,False,False,False,False
freq,2,2,2,2,2,2,2,2,2,2,2,2

In [15]:
# Checking Age for Null values
df_complete_data['Age'].isnull().sum()

263

In [16]:
#Segregating Unique titles
df_complete_data['Title']=df_complete_data.Name.apply(lambda x: x.split(',')[1].split('.')[0].strip())

In [17]:
df_complete_data['Title'].unique()

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms',
       'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt', 'the Countess',
       'Jonkheer', 'Dona'], dtype=object)

In [18]:
df_complete_data['Title'].value_counts()

Mr              757
Miss            260
Mrs             197
Master           61
Dr                8
Rev               8
Col               4
Mlle              2
Ms                2
Major             2
the Countess      1
Lady              1
Dona              1
Jonkheer          1
Sir               1
Capt              1
Mme               1
Don               1
Name: Title, dtype: int64

In [19]:
#categorizing Name on the basis of age and Sex
for i in range (len(df_complete_data)):
    if ((df_complete_data.iloc[i,df_complete_data.columns.get_loc('Sex')]=='male') and (df_complete_data.iloc[i,df_complete_data.columns.get_loc('Age')]<=14)):
        df_complete_data.iloc[i, df_complete_data.columns.get_loc('Title')] = 1
    if ((df_complete_data.iloc[i,df_complete_data.columns.get_loc('Sex')]=='female') and (df_complete_data.iloc[i,df_complete_data.columns.get_loc('Age')]<=14)):
        df_complete_data.iloc[i, df_complete_data.columns.get_loc('Title')] = 2
    if ((df_complete_data.iloc[i,df_complete_data.columns.get_loc('Sex')]=='male') and (df_complete_data.iloc[i,df_complete_data.columns.get_loc('Age')]>14)):
        df_complete_data.iloc[i, df_complete_data.columns.get_loc('Title')] = 3
    if ((df_complete_data.iloc[i,df_complete_data.columns.get_loc('Sex')]=='female') and (df_complete_data.iloc[i,df_complete_data.columns.get_loc('Age')]>14)):
        df_complete_data.iloc[i, df_complete_data.columns.get_loc('Title')] = 4

In [20]:
#Checking Null Value in Age 
df_complete_data[df_complete_data['Age'].isnull()]

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Title
5,NaN,NaN,Q,8.4583,"Moran, Mr. James",0,6,3,male,0,0.0,330877,Mr
17,NaN,NaN,S,13.0000,"Williams, Mr. Charles Eugene",0,18,2,male,0,1.0,244373,Mr
19,NaN,NaN,C,7.2250,"Masselmani, Mrs. Fatima",0,20,3,female,0,1.0,2649,Mrs
26,NaN,NaN,C,7.2250,"Emir, Mr. Farred Chehab",0,27,3,male,0,0.0,2631,Mr
28,NaN,NaN,Q,7.8792,"O'Dwyer, Miss. Ellen ""Nellie""",0,29,3,female,0,1.0,330959,Miss
...,...,...,...,...,...,...,...,...,...,...,...,...,...
408,NaN,NaN,Q,7.7208,"Riordan, Miss. Johanna Hannah""""",0,1300,3,female,0,NaN,334915,Miss
410,NaN,NaN,Q,7.7500,"Naughton, Miss. Hannah",0,1302,3,female,0,NaN,365237,Miss
413,NaN,NaN,S,8.0500,"Spector, Mr. Woolf",0,1305,3,male,0,NaN,A.5. 3236,Mr
416,NaN,NaN,S,8.0500,"Ware, Mr. Frederick",0,1308,3,male,0,NaN,359309,Mr
417,NaN,NaN,C,22.3583,"Peter, Master. Michael J",1,1309,3,male,1,NaN,2668,Master

In [21]:
Mean_1=df_complete_data[df_complete_data['Title']==1]['Age'].mean()
Mean_2=df_complete_data[df_complete_data['Title']==2]['Age'].mean()
Mean_3=df_complete_data[df_complete_data['Title']==3]['Age'].mean()
Mean_4=df_complete_data[df_complete_data['Title']==4]['Age'].mean()
print(Mean_1)
print(Mean_2)
print(Mean_3)
print(Mean_4)

6.018947368421052
5.9118
32.91514143094842
32.05621301775148

In [22]:
#Taking mean values 6 and 32
for i in range (len(df_complete_data)):
    if df_complete_data.iloc[i,df_complete_data.columns.get_loc('Title')] in ['Mr','Miss','Mrs','Rev','Dr','Col','Ms','Mlle','Major','Jonkheer','Don','Mme','Dona','Lady','the Countess','Capt','Sir']:
        df_complete_data.iloc[i,df_complete_data.columns.get_loc('Age')]=32
    if df_complete_data.iloc[i,df_complete_data.columns.get_loc('Title')] in ['Master']:
        df_complete_data.iloc[i,df_complete_data.columns.get_loc('Age')]=6
    if df_complete_data.iloc[i,df_complete_data.columns.get_loc('Title')] in ['Dr','Capt','Col','Don','Jonkheer','Major','Mr','Rev','Sir']:
        df_complete_data.iloc[i,df_complete_data.columns.get_loc('Title')]=3
    if df_complete_data.iloc[i,df_complete_data.columns.get_loc('Title')] in ['Dona','Lady','Miss','Mlle','Mme','Mrs','Ms']:
        df_complete_data.iloc[i,df_complete_data.columns.get_loc('Title')]=4
    if df_complete_data.iloc[i,df_complete_data.columns.get_loc('Title')] in ['Master']:
        df_complete_data.iloc[i,df_complete_data.columns.get_loc('Title')]=1

In [23]:
df_complete_data['Age'].isnull().sum()

0

In [24]:
df_complete_data.drop(columns=['Cabin','Name','Ticket'], inplace=True)
df_complete_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 10 columns):
Age            1309 non-null float64
Embarked       1309 non-null object
Fare           1309 non-null float64
Parch          1309 non-null int64
PassengerId    1309 non-null int64
Pclass         1309 non-null int64
Sex            1309 non-null object
SibSp          1309 non-null int64
Survived       891 non-null float64
Title          1309 non-null int64
dtypes: float64(3), int64(5), object(2)
memory usage: 152.5+ KB

In [25]:
#mapping the data
cleanup_maps={"Sex " :  {"male" : 1, "female" :  2},
             "Emabarked " :  {'S' : 1, 'Q' : 2, 'C' : 3}}

In [26]:
df_complete_data.replace(cleanup_maps, inplace=True)

In [27]:
df_complete_data.head()

,Age,Embarked,Fare,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Title
0,22.0,S,7.2500,0,1,3,male,1,0.0,3
1,38.0,C,71.2833,0,2,1,female,1,1.0,4
2,26.0,S,7.9250,0,3,3,female,0,1.0,4
3,35.0,S,53.1000,0,4,1,female,1,1.0,4
4,35.0,S,8.0500,0,5,3,male,0,0.0,3

In [28]:
df_complete_data.iloc[0]

Age              22
Embarked          S
Fare           7.25
Parch             0
PassengerId       1
Pclass            3
Sex            male
SibSp             1
Survived          0
Title             3
Name: 0, dtype: object

In [29]:
df_trainset=df_complete_data.iloc[0:891,:]
df_testset=df_complete_data.iloc[891:,:]
print(df_trainset.shape)
print(df_testset.shape)

(891, 10)
(418, 10)

In [30]:
train_passengerId=df_trainset['PassengerId']
test_passengerId=df_testset['PassengerId']
target=df_trainset['Survived']
df_trainset.drop(columns=['PassengerId','Survived'],inplace=True)
df_testset.drop(columns=['PassengerId','Survived'],inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:4102: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [31]:
df_trainset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 8 columns):
Age         891 non-null float64
Embarked    891 non-null object
Fare        891 non-null float64
Parch       891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null object
SibSp       891 non-null int64
Title       891 non-null int64
dtypes: float64(2), int64(4), object(2)
memory usage: 62.6+ KB

In [32]:
df_testset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 418 entries, 0 to 417
Data columns (total 8 columns):
Age         418 non-null float64
Embarked    418 non-null object
Fare        418 non-null float64
Parch       418 non-null int64
Pclass      418 non-null int64
Sex         418 non-null object
SibSp       418 non-null int64
Title       418 non-null int64
dtypes: float64(2), int64(4), object(2)
memory usage: 29.4+ KB

In [33]:
# Calling Decision Tree Model
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn import metrics

In [34]:
one_hot_encoded_training_predictors = pd.get_dummies(df_trainset)

In [35]:
one_hot_encoded_testing_predictors = pd.get_dummies(df_testset)

In [36]:
#logistic_regression= LogisticRegression()
decision_tree = DecisionTreeClassifier(random_state=0, max_depth=6)
decision_tree = decision_tree.fit(one_hot_encoded_training_predictors, target)
pred=decision_tree.predict(one_hot_encoded_testing_predictors)

In [37]:
pred

array([0., 0., 0., 0., 1., 0., 1., 0., 1., 0., 0., 0., 1., 0., 1., 1., 0.,
       0., 0., 0., 0., 1., 1., 0., 1., 0., 1., 0., 0., 0., 0., 0., 1., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 1., 0., 0., 0., 1., 1., 0.,
       0., 1., 1., 0., 0., 0., 0., 0., 1., 0., 0., 0., 1., 1., 1., 1., 0.,
       0., 1., 1., 0., 0., 0., 1., 0., 0., 1., 0., 1., 1., 0., 0., 0., 0.,
       0., 1., 0., 1., 1., 1., 0., 1., 0., 0., 0., 1., 0., 0., 0., 1., 0.,
       0., 0., 1., 0., 0., 0., 0., 0., 0., 1., 1., 1., 1., 0., 0., 1., 0.,
       1., 1., 0., 1., 0., 0., 1., 0., 1., 0., 0., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0., 0.,
       1., 0., 0., 1., 0., 0., 1., 1., 1., 1., 0., 0., 1., 0., 0., 1., 0.,
       0., 0., 0., 0., 0., 1., 1., 0., 1., 1., 0., 0., 1., 0., 1., 0., 1.,
       0., 0., 0., 0., 0., 1., 0., 1., 0., 1., 0., 0., 0., 1., 1., 0., 1.,
       0., 0., 1., 0., 1., 0., 0., 0., 0., 0., 0., 0., 1., 0., 1., 0., 1.,
       0., 1., 0., 1., 1., 0., 1., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0.,
       1., 1., 1., 1., 0., 0., 1., 0., 1., 0., 1., 1., 1., 0., 0., 0., 0.,
       0., 0., 0., 1., 0., 0., 0., 1., 1., 0., 0., 0., 0., 0., 0., 0., 0.,
       1., 1., 0., 1., 0., 0., 0., 0., 0., 1., 1., 1., 1., 0., 0., 0., 0.,
       0., 0., 1., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0., 0., 1., 0.,
       0., 1., 0., 0., 0., 0., 0., 0., 1., 1., 0., 0., 0., 0., 0., 0., 0.,
       0., 1., 0., 1., 0., 0., 0., 1., 0., 0., 1., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 1., 1., 0., 0., 0., 0., 1., 1., 0., 0., 0., 1., 0., 1.,
       0., 0., 1., 0., 1., 1., 0., 1., 0., 0., 1., 1., 0., 0., 1., 0., 0.,
       1., 1., 0., 0., 0., 0., 0., 0., 1., 1., 0., 1., 0., 0., 0., 0., 0.,
       1., 1., 0., 0., 1., 0., 1., 0., 0., 1., 0., 1., 0., 0., 0., 0., 0.,
       1., 1., 1., 1., 0., 0., 1., 0., 0., 1.])

In [38]:
data = {'PassengerId':test_passengerId, 'Survived':pred}
Result=pd.DataFrame(data)
Result['Survived']=Result['Survived'].apply(lambda x: int(x))
Result.head(25)

    PassengerId  Survived
0           892         0
1           893         0
2           894         0
3           895         0
4           896         1
5           897         0
6           898         1
7           899         0
8           900         1
9           901         0
10          902         0
11          903         0
12          904         1
13          905         0
14          906         1
15          907         1
16          908         0
17          909         0
18          910         0
19          911         0
20          912         0
21          913         1
22          914         1
23          915         0
24          916         1